#pragma once

namespace PoseLink
{
/*
    객체의 3차원 위치

    OpenGL에서 흔히 사용하는 오른손 좌표계:
        +X : 오른쪽
        +Y : 위쪽
        -Z : 화면 안쪽
    Unreal Engine에서 사용하는 좌표계:
        +X : 앞쪽
        +Y : 오른쪽
        +Z : 위쪽

    현재 위치 단위:
        meter(m)
*/
struct Position3D
{
    float x = 0.0f;
    float y = 0.0f;
    float z = 0.0f;
};

/*
    객체의 3차원 회전
    Euler Angle(pitch/yaw/roll)보다
    
    객체의 회전을 표현하는 쿼터니언
        q = w + xi + yj + zk
    또는 스칼라부와 벡터부로 나눠 표현
        q = (w,v)       w       : 스칼라 부분
        v = (x,y,z)     w, y, z : 벡터 부분
    중요:
        x,y,z는 각각 X,Y,Z축의 회전각이 아님

        어떤 축을 중심으로 얼마나 회전했는가를 나타낸다.
    
    ------------------------------------------------------------
    1. 회전축과 회전각으로부터 쿼터니언 만들기
    ------------------------------------------------------------
    
    단위 회전축을 다음과 같이 정의
        u = (ux,uy,uz)
    회전각을 Theta라고 하면
        w = cos(t/2)
        x = ux * sin(t/2)
        y = uy * sin(t/2)
        z = uz * sin(t/2)
    
    -> q = (w,x,y,z)

    예를 들어 Y축을 중심으로 90도 회전
    회전축 u = (0,1,0)
    회전각 t = 90도

    q = (cos(45),0,sin(45),0)
    
    회전각의 절반을 사용하는 이유
    벡터를 아래와 같이 변환하기 때문

    p' = q * p * q⁻¹

    위의 과정에서 쿼터니언이 벡터의 양쪽에 곱해지므로 
    Theta만큼 회전시키기 위해 Theta/2를 저장한다.

    ------------------------------------------------------------
    2. 단위 쿼터니언
    ------------------------------------------------------------

    회전을 표현하는 쿼터니언 -> 길이가 1이어야 한다
    |q| = sqrt(w² + x² + y² + z²)

    w² + x² + y² + z² = 1

    부동소수점 연산 반복시엔 오차로 인해 길이가 1에서 벗어날 수 있다.
    주기적 정규화 필요
    q_norm = q / |q|

    단위 쿼터니언에선 역원이 아래와 같음
    q⁻¹ = conjugate(q) = (w, -x, -y, -z)

    ------------------------------------------------------------
    3. 기본값이 의미하는 것
    ------------------------------------------------------------

    q = (1,0,0,0) : 회전하지 않은 상태인 항등 횢전
    w = (cos(0/2)) = 1, sin(0/2) = 0

    ------------------------------------------------------------
    4. 회전 조합
    ------------------------------------------------------------

    두 회전 q1, q2를 연속으로 적용 시, 곱셈으로 하나의 회전으로 합성 가능
    
    q_result = q2 * q1
    
    열 벡터와 위 회전식을 사용 시, q1을 먼저 적용하고, q2를 나중에 적용
    !. 쿼터니언 곱셈은 교환법칙 성림 x

    ------------------------------------------------------------
    5. SLERP
    ------------------------------------------------------------

    두 회전 사이를 일정한 각속도로 부드럽게 보간할 때
    SLERP(Spherical Linear Interpolation)를 사용 가능
        q(t) = SLERP(q_start, q_end, t)

        t = 0 -> q_start
        t = 1 -> q_end
    
    쿼터니언 -> 4차원 공간의 단위 구면 위에 졵재
        -> SLERP는 두 q사이의 구면 경로를 따라 이동 -> 회전 보간 ㄱㄴ
    
    !. q, -q는 동일한 3차원 회전
    !!. 두 쿼터니언의 내적이 음수라면 한쪽 쿼터니언의 부호를 반대로 바꾼다
        더 짧은 회전경로를 선택하는 처리가 필요하다.
*/
struct Quaternion
{
    float w = 1.0f;
    float x = 0.0f;
    float y = 0.0f;
    float z = 0.0f;
};

/*
    객체의 6DOF 상태
    
    Translation 3축:
        x,y,z
    Rotation 3축:
        Quaternion orientation
*/
struct Pose{
    Position3D position;
    Quaternion orientation;
};
} // namespace PoseLink
